package org.lyflexi.solutions.baseAlgorithm.queue.priority_queue;

import java.util.PriorityQueue;
import java.util.Queue;

/**
 * 239. 滑动窗口最大值
 * 已解答
 * 困难
 * 相关标签
 * premium lock icon
 * 相关企业
 * 提示
 * 给你一个整数数组 nums，有一个大小为 k 的滑动窗口从数组的最左侧移动到数组的最右侧。你只可以看到在滑动窗口内的 k 个数字。滑动窗口每次只向右移动一位。
 *
 * 返回 滑动窗口中的最大值 。
 *
 *
 *
 * 示例 1：
 *
 * 输入：nums = [1,3,-1,-3,5,3,6,7], k = 3
 * 输出：[3,3,5,5,6,7]
 * 解释：
 * 滑动窗口的位置                最大值
 * ---------------               -----
 * [1  3  -1] -3  5  3  6  7       3
 *  1 [3  -1  -3] 5  3  6  7       3
 *  1  3 [-1  -3  5] 3  6  7       5
 *  1  3  -1 [-3  5  3] 6  7       5
 *  1  3  -1  -3 [5  3  6] 7       6
 *  1  3  -1  -3  5 [3  6  7]      7
 * 示例 2：
 *
 * 输入：nums = [1], k = 1
 * 输出：[1]
 *
 *
 * 提示：
 *
 * 1 <= nums.length <= 105
 * -104 <= nums[i] <= 104
 * 1 <= k <= nums.length
 */

/**
 * 由于用了堆, 加上外层循环, 因此总的时间复杂度是nlogn
 */
public class LC239_maxSlidingWindow {
    public int[] maxSlidingWindow(int[] nums, int k) {
        int n = nums.length;
        //大顶堆
        Queue<int[]> heap = new PriorityQueue<>((a, b)-> {return b[0]- a[0];});
        int l = 0;
        int[] ans = new int[n - k + 1];
        for(int r = 0; r<n ; r++){
            //入堆
            heap.offer(new int[]{nums[r], r});

            int l0 = r - k + 1;
            //收缩窗口左端点的同时从堆中移除左端点元素
            // 问题一: 出堆的是最大元素, 那剩下的堆中小元素呢? 我们并不关注堆中的小元素, 这些小元素不影响答案
            // 问题二: 每次入堆最多1次, 那为什么不用if来出堆呢? 因为堆是优先队列, 和单调队列不同, 同样是排大小, 但是堆会打乱元素原有索引的相对顺序, 导致可能很多过期元素(索引很小的)排在了后面来不及全部清理, 只用if不够.
            //[9,10,9,-7,-4,-8,2,-6] k =5
            //窗口 = [0,4], heap:{(10,1), (9,0), (9,2), (-4,4), (-7,3)}
            //窗口 = [1,5], heap:{(10,1), (9,0), (9,2), (-4,4), (-7,3), (-8,5)}
            //窗口 = [2,6], heap:{(9,0), (9,2), (2,6), (-4,4), (-7,3), (-8,5)}//if只剔除了(10, 1), 无法剔除(9,0)
            //窗口 = [3,7], heap:{(9,2), (2,6), (-4,4), (-6,7), (-7,3), (-8,5)}//if只剔除了(9, 0), 无法剔除(9,2)
            //导致计算错误
            while(heap.peek()[1] < l0){
                heap.poll();
            }

            //记录答案
            if(l0 >=0){
                ans[l = l0] = heap.peek()[0];
            }
        }

        return ans;
    }
}
