package org.lyflexi;

import java.util.*;

/**
 * 189. 轮转数组
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给定一个整数数组 nums，将数组中的元素向右轮转 k 个位置，其中 k 是非负数。
 * 
 * 示例 1:
 * 
 * 输入: nums = [1,2,3,4,5,6,7], k = 3
 * 输出: [5,6,7,1,2,3,4]
 * 解释:
 * 向右轮转 1 步: [7,1,2,3,4,5,6]
 * 向右轮转 2 步: [6,7,1,2,3,4,5]
 * 向右轮转 3 步: [5,6,7,1,2,3,4]
 * 
 * 示例 2:
 * 
 * 输入：nums = [-1,-100,3,99], k = 2
 * 输出：[3,99,-1,-100]
 * 解释:
 * 向右轮转 1 步: [99,-1,-100,3]
 * 向右轮转 2 步: [3,99,-1,-100]
 * 
 * 提示：
 * 
 * - 1 <= nums.length <= 10^5
 * 
 * - -2^31 <= nums[i] <= 2^31 - 1
 * 
 * - 0 <= k <= 10^5
 * 
 * 进阶：
 * 
 * - 尽可能想出更多的解决方案，至少有 三种 不同的方法可以解决这个问题。
 * 
 * - 你可以使用空间复杂度为 O(1) 的 原地 算法解决这个问题吗？
 */

/**
 * 算法
 * 这里假设 $0<= k < n$，对于 $k>= n$ 的情况，可以转换成 $0<= k < n$ 的情况（证明见后文）。
 * 
 * 设 $nums=A+B$，其中 $A$ 是 $nums$ 的前 $n-k$ 个数，$B$ 是后 $k$ 个数。在上例中，$A=[1,2,3,4]$，$B=[5,6,7]$。
 * 
 * 题目要求把 $A+B$ 变成 $B+A$，这可以用三次反转实现：
 * 
 * 1. 把 $nums = A+B$ 反转，我们得到了 $rev(B) + rev(A)$，其中 $rev(A)$ 表示数组 $A$ 反转后的结果。在上例中，$rev(B) + rev(A) = [7,6,5] + [4,3,2,1]$。
 * 2. 单独反转 $rev(B)$，因为一个数组反转两次是不变的，所以 $rev(rev(B))=B$，我们得到了 $B$。
 * 3. 单独反转 $rev(A)$，得到 $rev(rev(A))=A$。
 * 4. 现在数组变成 $B+A$。在上例中，$B+A = [5,6,7] + [1,2,3,4]$，这正是我们想要的结果。
 */
public class Hot015_LC189_rotate {
    public void rotate(int[] nums, int k) {
        int n = nums.length;
        k %= n; // 轮转 k 次等同于轮转 k % n 次
        reverse(nums, 0, n - 1);
        reverse(nums, 0, k - 1);
        reverse(nums, k, n - 1);
    }

    private void reverse(int[] nums, int i, int j) {
        while (i < j) {
            int tmp = nums[i];
            nums[i] = nums[j];
            nums[j] = tmp;
            i++;
            j--;
        }
    }
}
