package org.lyflexi;

import java.util.*;

/**
 * 45. 跳跃游戏 II
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给定一个长度为 n 的 0 索引整数数组 nums。初始位置在下标 0。
 * 
 * 每个元素 nums[i] 表示从索引 i 向后跳转的最大长度。换句话说，如果你在索引 i 处，你可以跳转到任意 (i + j) 处：
 * 
 * - 0 <= j <= nums[i] 且
 * 
 * - i + j < n
 * 
 * 返回到达 n - 1 的最小跳跃次数。测试用例保证可以到达 n - 1。
 * 
 * 示例 1:
 * 
 * 输入: nums = [2,3,1,1,4]
 * 输出: 2
 * 解释: 跳到最后一个位置的最小跳跃数是 2。
 *      从下标为 0 跳到下标为 1 的位置，跳 1 步，然后跳 3 步到达数组的最后一个位置。
 * 
 * 示例 2:
 * 
 * 输入: nums = [2,3,0,1,4]
 * 输出: 2
 * 
 * 提示:
 * 
 * - 1 <= nums.length <= 10^4
 * 
 * - 0 <= nums[i] <= 1000
 * 
 * - 题目保证可以到达 n - 1
 */

/**
 * 答疑
 * 
 * 问：为什么这个贪心策略是对的？
 * 
 * 答：其实这个做法是对暴力的优化。题目让我们计算到达 $n-1$ 的最小跳跃次数，暴力的做法是，用暴力搜索（或者 BFS）算出跳一次最远可以到哪，跳两次最远可以到哪，跳三次最远可以到哪……跳到 $n-1$ 的最小跳跃次数就是答案。设跳 $k$ 次最远可以到达 $curEnd$，那么下标在 $[0,curEnd]$ 中的最大的 $i+nums[i]$，就是跳 $k+1$ 次最远可以到达的位置 $nextEnd$。当我们遍历到 $i=curEnd$ 时，通过计算遍历过的 $i+nums[i]$ 的最大值，可以算出再跳一步最远能到哪里。这本质是一个递推式（$k\to k+1$），根据这个递推式，就能从跳 $k=0$ 步开始（此时最远到达 $0$），依次递推算出跳 $k=1,2,3,\ldots$ 步后的最远位置。
 * 
 * 问：为什么代码只遍历到 $n-2$？
 * 
 * 答：这题 $n-1$ 是终点，$nums[n-1]$ 这个数没有任何意义，完全可以把这个数删了，在长为 $n-1$ 的数组上跑这个算法。或者说，遍历到 $nums[n-2]$ 时，要么已经可以到达终点，要么需要造最后一座桥。$n-1$ 已经是终点了，不需要造桥。
 * 
 * 问：如果题目没有保证一定能到达 $n-1$，代码要怎么改？
 * 
 * 答：见 1326. 灌溉花园的最少水龙头数目，我的题解。
 */
public class Hot079_LC45_jump {
    public int jump(int[] nums) {
        int ans = 0;
        int curEnd = 0; // 已建造的桥的右端点
        int nextEnd = 0; // 下一座桥的右端点的最大值
        for (int i = 0; i < nums.length - 1; i++) {
            // 遍历的过程中，记录下一座桥的最远点
            nextEnd = Math.max(nextEnd, i + nums[i]);
            if (i == curEnd) { // 无路可走，必须建桥
                curEnd = nextEnd; // 建桥后，最远可以到达 nextEnd
                ans++;
            }
        }
        return ans;
    }
}
