package org.lyflexi;

import java.util.*;

/**
 * 437. 路径总和 III
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给定一个二叉树的根节点 root ，和一个整数 targetSum ，求该二叉树里节点值之和等于 targetSum 的 路径 的数目。
 * 
 * 路径 不需要从根节点开始，也不需要在叶子节点结束，但是路径方向必须是向下的（只能从父节点到子节点）。
 * 
 * 示例 1：
 * 
 * 输入：root = [10,5,-3,3,2,null,11,3,-2,null,1], targetSum = 8
 * 输出：3
 * 解释：和等于 8 的路径有 3 条，如图所示。
 * 
 * 示例 2：
 * 
 * 输入：root = [5,4,8,11,null,13,4,7,2,null,null,5,1], targetSum = 22
 * 输出：3
 * 
 * 提示:
 * 
 * - 二叉树的节点个数的范围是 [0,1000]
 * 
 * - -10^9 <= Node.val <= 10^9
 * 
 * - -1000 <= targetSum <= 1000
 */

/**
 * 答疑
 * 
 * 问：为什么这样做是对的？不会漏算多算吗？
 * 
 * 答：不会漏算多算。首先最暴力的做法是，枚举终点，枚举起点，判断起点到终点的路径和是否恰好等于 $targetSum$，是就把答案加一。暴力做法必然不会漏算多算。我们的做法其实是对暴力的优化，保留了枚举终点这一步，把枚举起点这一步通过哈希表优化成了 $O(1)$。
 * 
 * 问：为什么要初始化哈希表 $cnt[0] = 1$？
 * 
 * 答：同 560 题，这里的 $0$ 相当于前缀和数组中的 $s[0]=0$。举个最简单的例子，根节点值为 $1$，$targetSum=1$。如果不把 $0$ 加到哈希表中，按照我们的算法，没法算出这里有 $1$ 条符合要求的路径。也可以这样理解，要想把任意路径和都表示成两个前缀和的差，必须添加一个 $0$，否则当路径是前缀时（从根节点开始的路径），没法减去一个数，具体见 前缀和及其扩展 中的讲解。
 * 
 * 问：为什么代码中要先更新 $ans$，再更新 $cnt$？
 * 
 * 答：在 $targetSum\ne 0$ 的情况下，这俩谁先谁后都可以。但如果 $targetSum=0$，假设根节点值为 $1$，如果先把 $cnt[1]$ 增加 $1$，再把 $ans$ 增加 $cnt[s-targetSum] = cnt[1] = 1$，就相当于我们找到了一条和为 $targetSum=0$ 的路径，但和为 $0$ 的路径是不存在的。另一种理解方式是，空路径的元素和等于 $0$，我们把这个 $0$ 当作了符合要求的路径，但题目要统计的是非空路径。
 * 
 * 问：代码中的「恢复现场」用意何在？
 * 
 * 答：举个例子，递归完 $node$ 子树，假设接下来要递归 $node$ 父节点的右子树。如果我们不恢复现场，那么 $cnt$ 中还保存着 $node$ 子树的数据。但对于 $node$ 父节点的右子树来说，要计算的路径并不涉及到 $node$ 子树的任何节点。如果不恢复现场，$cnt$ 中统计的前缀和个数会更多，我们算出来的答案可能比正确答案更大。
 * 
 * 问：为什么递归参数 $s$ 不需要恢复现场？
 * 
 * 答：$s$ 是基本类型，在函数调用的时候会复制一份往下传递，s += node.val 修改的仅仅是当前递归函数中的 $s$ 参数，并不会影响到其他递归函数中的 $s$。注：如果把 $s$ 声明在递归函数外，全局只有一个 $s$，那么执行 s += node.val 就会影响全局了，这种情况需要写 s -= node.val 恢复现场。
 * 
 * 问：能不能枚举起点？
 * 
 * 答：首先对比一下，枚举终点的话，起点都在上面，都在一条链中（根到当前节点），很好维护；而枚举起点，终点都在下面（$node$ 子树），是分散的，不好维护。对比可以发现，枚举终点，维护起点是更方便的。硬要枚举起点是可以做的，对于每个节点 $node$，返回根到 $node$ 子树中的每个节点的前缀和（返回一个哈希表）。在合并左右子树的哈希表时，应当使用启发式合并，也就是把小的哈希表合并到大的哈希表中，从而保证 $O(nlog n)$ 的时间复杂度。所以枚举起点不仅麻烦，而且更慢。
 */
public class Hot048_LC437_pathSum2 {
    public int pathSum(TreeNode root, int targetSum) {
        // key：从根到 node 的节点值之和
        // value：节点值之和的出现次数
        // 注意在递归过程中，哈希表只保存根到 node 的路径的前缀的节点值之和
        Map<Long, Integer> cnt = new HashMap<>();
        cnt.put(0L, 1);
        return dfs(root, 0, targetSum, cnt);
    }

    // s 表示从根到 node 的父节点的节点值之和（node 的节点值尚未计入）
    // 返回在 node 子树中找到了多少个以 x 结尾的符合要求的路径，其中节点 x 是 node 子树中的节点
    private int dfs(TreeNode node, long s, int targetSum, Map<Long, Integer> cnt) {
        if (node == null) {
            return 0;
        }

        s += node.val;
        // 把 node 当作路径的终点，统计有多少个起点
        int ans = cnt.getOrDefault(s - targetSum, 0);

        cnt.merge(s, 1, Integer::sum); // cnt[s]++
        ans += dfs(node.left, s, targetSum, cnt);
        ans += dfs(node.right, s, targetSum, cnt);
        cnt.merge(s, -1, Integer::sum); // 撤销 cnt[s]++（恢复现场）

        return ans;
    }
}
