package org.lyflexi;

import java.util.*;

/**
 * 153. 寻找旋转排序数组中的最小值
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 已知一个长度为 n 的数组，预先按照升序排列，经由 1 到 n 次 旋转 后，得到输入数组。例如，原数组 nums = [0,1,2,4,5,6,7] 在变化后可能得到：
 * 
 * - 若旋转 4 次，则可以得到 [4,5,6,7,0,1,2]
 * 
 * - 若旋转 7 次，则可以得到 [0,1,2,4,5,6,7]
 * 
 * 注意，数组 [a[0], a[1], a[2], ..., a[n-1]] 旋转一次 的结果为数组 [a[n-1], a[0], a[1], a[2], ..., a[n-2]] 。
 * 
 * 给你一个元素值 互不相同 的数组 nums ，它原来是一个升序排列的数组，并按上述情形进行了多次旋转。请你找出并返回数组中的 最小元素 。
 * 
 * 你必须设计一个时间复杂度为 O(log n) 的算法解决此问题。
 * 
 * 示例 1：
 * 
 * 输入：nums = [3,4,5,1,2]
 * 输出：1
 * 解释：原数组为 [1,2,3,4,5] ，旋转 3 次得到输入数组。
 * 
 * 示例 2：
 * 
 * 输入：nums = [4,5,6,7,0,1,2]
 * 输出：0
 * 解释：原数组为 [0,1,2,4,5,6,7] ，旋转 4 次得到输入数组。
 * 
 * 示例 3：
 * 
 * 输入：nums = [11,13,15,17]
 * 输出：11
 * 解释：原数组为 [11,13,15,17] ，旋转 4 次得到输入数组。
 * 
 * 提示：
 * 
 * - n == nums.length
 * 
 * - 1 <= n <= 5000
 * 
 * - -5000 <= nums[i] <= 5000
 * 
 * - nums 中的所有整数 互不相同
 * 
 * - nums 原来是一个升序排序的数组，并进行了 1 至 n 次旋转
 */

/**
 * 答疑
 * 
 * 问：能否与 $nums[0]$ 比大小？
 * 
 * 答：可以，但要多写一点代码。假设 $nums$ 有两段。如果 $nums[mid] > nums[0]$，那么 $mid$ 在第一段，在最小值左边；否则，$mid$ 要么是最小值，要么在最小值右边。这种写法需要在 $(0,n)$ 中二分，如果二分结果等于 $n$，说明 $nums$ 其实只有一段，答案是 $nums[0]$。
 */
public class Hot067_LC153_findMin {
    public int findMin(int[] nums) {
        int n = nums.length;
        int left = -1;
        int right = n - 1; // 开区间 (-1, n-1)
        while (left + 1 < right) { // 开区间不为空
            int mid = (left + right) >>> 1;
            if (nums[mid] < nums[n - 1]) {
                right = mid;
            } else {
                left = mid;
            }
        }
        return nums[right];
    }
}
