package org.lyflexi;

import java.util.*;

/**
 * 31. 下一个排列
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 整数数组的一个 排列  就是将其所有成员以序列或线性顺序排列。
 * 
 * - 例如，arr = [1,2,3] ，以下这些都可以视作 arr 的排列：[1,2,3]、[1,3,2]、[3,1,2]、[2,3,1] 。
 * 
 * 整数数组的 下一个排列 是指其整数的下一个字典序更大的排列。更正式地，如果数组的所有排列根据其字典顺序从小到大排列在一个容器中，那么数组的 下一个排列 就是在这个有序容器中排在它后面的那个排列。如果不存在下一个更大的排列，那么这个数组必须重排为字典序最小的排列（即，其元素按升序排列）。
 * 
 * - 例如，arr = [1,2,3] 的下一个排列是 [1,3,2] 。
 * 
 * - 类似地，arr = [2,3,1] 的下一个排列是 [3,1,2] 。
 * 
 * - 而 arr = [3,2,1] 的下一个排列是 [1,2,3] ，因为 [3,2,1] 不存在一个字典序更大的排列。
 * 
 * 给你一个整数数组 nums ，找出 nums 的下一个排列。
 * 
 * 必须 原地 修改，只允许使用额外常数空间。
 * 
 * 示例 1：
 * 
 * 输入：nums = [1,2,3]
 * 输出：[1,3,2]
 * 
 * 示例 2：
 * 
 * 输入：nums = [3,2,1]
 * 输出：[1,2,3]
 * 
 * 示例 3：
 * 
 * 输入：nums = [1,1,5]
 * 输出：[1,5,1]
 * 
 * 提示：
 * 
 * - 1 <= nums.length <= 100
 * 
 * - 0 <= nums[i] <= 100
 */

/**
 * 答疑
 * 
 * 问：第一步找到 $x$ 后，为什么 $x$ 右边的数是递减的？
 * 
 * 答：反证法。假设 $x$ 右边的数不是递减的，也就是说，在 $x$ 的右边，存在 $nums[i] < nums[i+1]$ 的情况，那么我们应把 $nums[i]$ 当作 $x$，这与事实矛盾。
 * 
 * 问：为什么第二步交换后，右边的序列仍然是递减的？
 * 
 * 答：设交换前 $nums=[\ldots,x,c,b,a,\ldots]$，其中大小关系为 $c>b>x>a$。那么 $x$ 右边最小的大于 $x$ 的数是 $b$。交换 $x$ 和 $b$，得到 $[\ldots,b,c,x,a,\ldots]$，其中 $c>x>a>...$，仍然是递减的。
 * 
 * 问：如果 $nums$ 是第一个排列，我们是怎么算的？
 * 
 * 答：例如 $nums=[1,2,3]$。第一步找到 $2$，第二步交换 $2$ 和 $3$，第三步反转 $2$（只有一个数，反转后还是 $2$），最终得到 $[1,3,2]$。读者可以动手算算 $[1,3,2]$ 的后续排列，以加深印象。
 */
public class Hot099_LC31_nextPermutation {
    public void nextPermutation(int[] nums) {
        int n = nums.length;

        // 第一步：从右到左找到第一个小于 nums[i+1] 的数 nums[i]
        int i = n - 2;
        while (i >= 0 && nums[i] >= nums[i + 1]) {
            i--;
        }

        // 如果找到了，进入第二步；否则跳过第二步，反转整个数组
        if (i >= 0) {
            // 第二步：从右到左找到 nums[i] 右边最小的大于 nums[i] 的数 nums[j]
            int j = n - 1;
            while (nums[j] <= nums[i]) {
                j--;
            }
            // 交换 nums[i] 和 nums[j]
            swap(nums, i, j);
        }

        // 第三步：反转 [i+1, n-1]（如果上面跳过第二步，此时 i = -1）
        reverse(nums, i + 1, n - 1);
    }

    private void swap(int[] nums, int i, int j) {
        int tmp = nums[i];
        nums[i] = nums[j];
        nums[j] = tmp;
    }

    private void reverse(int[] nums, int left, int right) {
        while (left < right) {
            swap(nums, left++, right--);
        }
    }
}
