package org.lyflexi;

import java.util.*;

/**
 * 70. 爬楼梯
 * 已解答
 * 简单
 * 相关标签
 * premium lock icon
 * 相关企业
 * 假设你正在爬楼梯。需要 n 阶你才能到达楼顶。
 * 
 * 每次你可以爬 1 或 2 个台阶。你有多少种不同的方法可以爬到楼顶呢？
 * 
 * 示例 1：
 * 
 * 输入：n = 2
 * 输出：2
 * 解释：有两种方法可以爬到楼顶。
 * 1. 1 阶 + 1 阶
 * 2. 2 阶
 * 
 * 示例 2：
 * 
 * 输入：n = 3
 * 输出：3
 * 解释：有三种方法可以爬到楼顶。
 * 1. 1 阶 + 1 阶 + 1 阶
 * 2. 1 阶 + 2 阶
 * 3. 2 阶 + 1 阶
 * 
 * 提示：
 * 
 * - 1 <= n <= 45
 */

/**
 * 二、递归怎么写：状态定义与状态转移方程
 * 
 * 因为要解决的问题都是「从 $0$ 爬到 $i$」，所以定义 $dfs(i)$ 表示从 $0$ 爬到 $i$ 有多少种不同的方法（或者说爬 $i$ 个台阶的方案数）。
 * 
 * 分类讨论：
 * 
 * - 如果最后一步爬了 $1$ 个台阶，那么我们得先爬到 $i-1$，要解决的问题缩小成：从 $0$ 爬到 $i-1$ 有多少种不同的方法。
 * - 如果最后一步爬了 $2$ 个台阶，那么我们得先爬到 $i-2$，要解决的问题缩小成：从 $0$ 爬到 $i-2$ 有多少种不同的方法。
 * 
 * 由于这两种方法是互相独立的（爬的台阶个数不同），所以根据加法原理，从 $0$ 爬到 $i$ 的方法数等于这两种方法数之和，即
 * 
 * $$
 * dfs(i) = dfs(i-1) + dfs(i-2)
 * $$
 * 
 * 递归边界：$dfs(0)=1,\ dfs(1)=1$。从 $0$ 爬到 $0$ 有一种方法，即原地不动。从 $0$ 爬到 $1$ 有一种方法，即爬 $1$ 个台阶。
 * 
 * 递归入口：$dfs(n)$，也就是答案（爬 $n$ 个台阶的方案数）。
 * 
 * 问：为什么 $0$ 到 $0$ 算一种方法？
 * 
 * 答：也可以这样理解，如果 $dfs(0)=0$，那么 $dfs(2)=dfs(1) + dfs(0)=1$，这显然是错误的，因为有两种方法可以爬到 $2$。所以（倒推出）$dfs(0)$ 是 $1$。
 */
// 会超时的递归代码
public class Hot081_LC70_climbStairs {
    public int climbStairs(int n) {
        return dfs(n);
    }

    private int dfs(int i) {
        if (i <= 1) { // 递归边界
            return 1;
        }
        return dfs(i - 1) + dfs(i - 2);
    }
}
