package org.lyflexi;

import java.util.*;

/**
 * 62. 不同路径
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。
 * 
 * 机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。
 * 
 * 问总共有多少条不同的路径？
 * 
 * 示例 1：
 * 
 * 输入：m = 3, n = 7
 * 输出：28
 * 
 * 示例 2：
 * 
 * 输入：m = 3, n = 2
 * 输出：3
 * 解释：
 * 从左上角开始，总共有 3 条路径可以到达右下角。
 * 1. 向右 -> 向下 -> 向下
 * 2. 向下 -> 向下 -> 向右
 * 3. 向下 -> 向右 -> 向下
 * 
 * 示例 3：
 * 
 * 输入：m = 7, n = 3
 * 输出：28
 * 
 * 示例 4：
 * 
 * 输入：m = 3, n = 3
 * 输出：6
 * 
 * 提示：
 * 
 * - 1 <= m, n <= 100
 * 
 * - 题目数据保证答案小于等于 2 * 10^9
 */

/**
 * 四、1:1 翻译成递推
 * 
 * 我们可以去掉递归中的「递」，只保留「归」的部分，即自底向上计算。
 * 
 * 具体来说，$f[i+1][j+1]$ 的定义和 $dfs(i,j)$ 的定义是一样的，都表示从起点 $(0,0)$ 走到 $(i,j)$ 的方案数。这里 $+1$ 是为了把 $dfs(-1,j)$ 和 $dfs(i,-1)$ 这些状态也翻译过来，这样我们可以把 $f[0][j]$ 和 $f[i][0]$ 作为初始值。
 * 
 * 相应的递推式（状态转移方程）也和 $dfs$ 一样：
 * 
 * $$
 * f[i+1][j+1] = f[i][j+1] + f[i+1][j]
 * $$
 * 
 * 初始值：
 * 
 * - $f[0][j]=f[i][0] = 0$，翻译自递归边界 $dfs(-1,j)=dfs(i,-1)=0$。
 * - $f[1][1]=1$，翻译自递归边界 $dfs(0,0)=1$。
 * 
 * 答案为 $f[m][n]$，翻译自递归入口 $dfs(m-1,n-1)$。
 */
public class Hot091_LC62_uniquePaths2 {
    public int uniquePaths(int m, int n) {
        int[][] f = new int[m + 1][n + 1];
        for (int i = 0; i < m; i++) {
            for (int j = 0; j < n; j++) {
                if (i == 0 && j == 0) {
                    f[1][1] = 1;
                } else {
                    f[i + 1][j + 1] = f[i][j + 1] + f[i + 1][j];
                }
            }
        }
        return f[m][n];
    }
}
