package org.lyflexi;

import java.util.*;

/**
 * 32. 最长有效括号
 * 已解答
 * 困难
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给你一个只包含 '(' 和 ')' 的字符串，找出最长有效（格式正确且连续）括号 子串 的长度。
 * 
 * 左右括号匹配，即每个左括号都有对应的右括号将其闭合的字符串是格式正确的，比如 "(()())"。
 * 
 * 示例 1：
 * 
 * 输入：s = "(()"
 * 输出：2
 * 解释：最长有效括号子串是 "()"
 * 
 * 示例 2：
 * 
 * 输入：s = ")()())"
 * 输出：4
 * 解释：最长有效括号子串是 "()()"
 * 
 * 示例 3：
 * 
 * 输入：s = ""
 * 输出：0
 * 
 * 提示：
 * 
 * - 0 <= s.length <= 3 * 10^4
 * 
 * - s[i] 为 '(' 或 ')'
 */

/**
 * 优化：O(1) 空间复杂度
 * 
 * 对于有效括号字符串，左括号和右括号的个数是相等的。
 * 
 * 能不能只记录左右括号的个数，并在左括号个数等于右括号个数时，更新答案？
 * 
 * 比如 $s = ())()$，从左到右遍历：
 * 
 * |  $i$ | $s[i]$  | 左括号个数  | 右括号个数  | 说明 |
 * |:---:|:---:|:---:|:---:|---|
 * |  $0$ |  $($ | $1$  |  $0$ |   |
 * |  $1$ |  $)$ | $1$  |  $1$ | 个数相同，有效括号长度为 $2$  |
 * |  $2$ |  $)$ | $0$  |  $0$ | 右括号太多了，重置个数为 $0$  |
 * |  $3$ |  $($ | $1$  |  $0$ |   |
 * |  $4$ |  $)$ | $1$  |  $1$ | 个数相同，有效括号长度为 $2$  |
 * 
 * 又比如 $s = ()(()$，从左到右遍历：
 * 
 * |  $i$ | $s[i]$  | 左括号个数  | 右括号个数  | 说明 |
 * |:---:|:---:|:---:|:---:|---|
 * |  $0$ |  $($ | $1$  |  $0$ |   |
 * |  $1$ |  $)$ | $1$  |  $1$ | 个数相同，有效括号长度为 $2$  |
 * |  $2$ |  $($ | $2$  |  $1$ |   |
 * |  $3$ |  $($ | $3$  |  $1$ |   |
 * |  $4$ |  $)$ | $3$  |  $2$ | 无法判断有效括号长度（见下面解释） |
 * 
 * 设 $left$ 为左括号的个数，$right$ 为右括号的个数，分类讨论：
 * 
 * - 如果 $left = right$，有效括号长度为 $right\cdot 2$。
 * - 如果 $left < right$，右括号太多了，重置计数器 $left = right = 0$。
 * - 如果 $left > right$，我们无法只根据 $left$ 和 $right$ 就确定有效括号的长度。比如 $left=3$，$right=2$，那么 $s$ 是 $((())$ 还是 $()(()$？有效括号长为 $4$ 还是 $2$？如何解决 $left > right$ 这种左括号很多的情况呢？
 * 
 * 把 $s$ 旋转 $180^{\circ}$，多出来的左括号就移到了后面，比如 $\color{red(}(())$ 变成 $(())\color{red)}$。这样我们就能甩掉红色括号的干扰，在遍历过程中遇到 $left = right = 2$ 的情况，成功算出答案 $4$。所以再倒着遍历一遍 $s$，就不会算漏了。
 */
public class Hot090_LC32_longestValidParentheses5 {
    public int longestValidParentheses(String s) {
        int n = s.length();
        int ans = 0;
        int left = 0;
        int right = 0;
        for (int i = 0; i < n; i++) {
            if (s.charAt(i) == '(') {
                left++;
            } else {
                right++;
            }
            if (left < right) { // 右括号太多了，重置计数器
                left = right = 0;
            } else if (left == right) {
                ans = Math.max(ans, right * 2);
            }
        }

        left = right = 0;
        for (int i = n - 1; i >= 0; i--) {
            if (s.charAt(i) == ')') {
                left++;
            } else {
                right++;
            }
            if (left < right) {
                left = right = 0;
            } else if (left == right) {
                ans = Math.max(ans, right * 2);
            }
        }
        return ans;
    }
}
