package org.lyflexi;

import java.util.*;

/**
 * 2. 两数相加
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给你两个 非空 的链表，表示两个非负的整数。它们每位数字都是按照 逆序 的方式存储的，并且每个节点只能存储 一位 数字。
 * 
 * 请你将两个数相加，并以相同形式返回一个表示和的链表。
 * 
 * 你可以假设除了数字 0 之外，这两个数都不会以 0 开头。
 * 
 * 示例 1：
 * 
 * 输入：l1 = [2,4,3], l2 = [5,6,4]
 * 输出：[7,0,8]
 * 解释：342 + 465 = 807.
 * 
 * 示例 2：
 * 
 * 输入：l1 = [0], l2 = [0]
 * 输出：[0]
 * 
 * 示例 3：
 * 
 * 输入：l1 = [9,9,9,9,9,9,9], l2 = [9,9,9,9]
 * 输出：[8,9,9,9,0,0,0,1]
 * 
 * 提示：
 * 
 * - 每个链表中的节点数在范围 [1, 100] 内
 * 
 * - 0 <= Node.val <= 9
 * 
 * - 题目数据保证列表表示的数字不含前导零
 */

/**
 * 迭代的思路是，初始化答案为一个「空链表」，每次循环，向该链表末尾添加一个节点（保存一个数位）。
 * 
 * 循环即遍历链表 $l_1$ 和 $l_2$，每次把两个节点值 $l_1.val,\ l_2.val$ 与进位值 $carry$ 相加，除以 $10$ 的余数即为当前节点需要保存的数位，除以 $10$ 的商即为新的进位值。
 * 
 * 需要注意的是，在第一次循环时，我们无法往一个空节点的末尾添加节点。这里的技巧是，创建一个哨兵节点（dummy node），当成初始的「空链表」。循环结束后，哨兵节点的下一个节点就是最终要返回的链表头节点。
 */
public class Hot028_LC2_addTwoNumbers3 {
    public ListNode addTwoNumbers(ListNode l1, ListNode l2) {
        ListNode dummy = new ListNode(); // 哨兵节点
        ListNode cur = dummy;
        int carry = 0; // 进位值
        while (l1 != null || l2 != null || carry != 0) { // 有一个不是空节点，或者还有进位，就继续迭代
            int sum = carry;
            if (l1 != null) {
                sum += l1.val; // 节点值和进位加在一起
                l1 = l1.next; // 下一个节点
            }
            if (l2 != null) {
                sum += l2.val; // 节点值和进位加在一起
                l2 = l2.next; // 下一个节点
            }
            cur = cur.next = new ListNode(sum % 10); // 每个节点保存一个数位
            carry = sum / 10; // 新的进位
        }
        return dummy.next; // 哨兵节点的下一个节点就是头节点
    }
}
