package org.lyflexi;

import java.util.*;

/**
 * 230. 二叉搜索树中第 K 小的元素
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给定一个二叉搜索树的根节点 root ，和一个整数 k ，请你设计一个算法查找其中第 k 小的元素（k 从 1 开始计数）。
 * 
 * 示例 1：
 * 
 * 输入：root = [3,1,4,null,2], k = 1
 * 输出：1
 * 
 * 示例 2：
 * 
 * 输入：root = [5,3,6,2,4,null,null,1], k = 3
 * 输出：3
 * 
 * 提示：
 * 
 * - 树中的节点数为 n 。
 * 
 * - 1 <= k <= n <= 10^4
 * 
 * - 0 <= Node.val <= 10^4
 * 
 * 进阶：如果二叉搜索树经常被修改（插入/删除操作）并且你需要频繁地查找第 k 小的值，你将如何优化算法？
 */

/**
 * 写法二：不记录答案 + 提前返回
 * 
 * 写法一使用了一个外部变量记录答案，能否不使用外部变量记录呢？
 * 
 * 可以，做法如下：
 * 
 * 1. 递归边界：如果当前节点是空节点，返回 $-1$，表示没有找到。注意题目保证节点值非负。
 * 2. 执行中序遍历，先递归左子树。
 * 3. 判断左子树的返回值 $leftRes$ 是否为 $-1$。如果不是 $-1$，说明我们在左子树中找到了答案，返回 $leftRes$。如果是 $-1$，说明尚未找到答案，继续下一步。
 * 4. 把 $k$ 减少 $1$。如果 $k=0$，那么答案就是当前节点值，返回当前节点值。
 * 5. 现在，答案要么在当前节点的右子树中，要么在除了当前子树的其余节点中。递归右子树，如果答案在右子树中，那么直接返回答案；如果答案不在右子树中，那么右子树也会返回 $-1$，由于当前子树搜索完毕，所以当前子树没有找到答案，返回 $-1$。综上所述，可以直接返回右子树的返回值。
 */
public class Hot044_LC230_kthSmallest2 {
    private int k;

    public int kthSmallest(TreeNode root, int k) {
        this.k = k;
        return dfs(root);
    }

    private int dfs(TreeNode node) {
        if (node == null) {
            return -1; // 题目保证节点值非负，用 -1 表示没有找到
        }
        int leftRes = dfs(node.left);
        if (leftRes != -1) { // 答案在左子树中
            return leftRes;
        }
        if (--k == 0) { // 答案就是当前节点
            return node.val;
        }
        return dfs(node.right); // 右子树会返回答案或者 -1
    }
}
