package org.lyflexi;

import java.util.*;

/**
 * 70. 爬楼梯
 * 已解答
 * 简单
 * 相关标签
 * premium lock icon
 * 相关企业
 * 假设你正在爬楼梯。需要 n 阶你才能到达楼顶。
 * 
 * 每次你可以爬 1 或 2 个台阶。你有多少种不同的方法可以爬到楼顶呢？
 * 
 * 示例 1：
 * 
 * 输入：n = 2
 * 输出：2
 * 解释：有两种方法可以爬到楼顶。
 * 1. 1 阶 + 1 阶
 * 2. 2 阶
 * 
 * 示例 2：
 * 
 * 输入：n = 3
 * 输出：3
 * 解释：有三种方法可以爬到楼顶。
 * 1. 1 阶 + 1 阶 + 1 阶
 * 2. 1 阶 + 2 阶
 * 3. 2 阶 + 1 阶
 * 
 * 提示：
 * 
 * - 1 <= n <= 45
 */

/**
 * 四、1:1 翻译成递推
 * 
 * 我们可以去掉递归中的「递」，只保留「归」的部分，即自底向上计算。
 * 
 * 具体来说，$f[i]$ 的定义和 $dfs(i)$ 的定义是一样的，都表示从 $0$ 爬到 $i$ 有多少种不同的方法（或者说爬 $i$ 个台阶的方案数）。
 * 
 * 相应的递推式（状态转移方程）也和 $dfs$ 一样：
 * 
 * $$
 * f[i] = f[i-1] + f[i-2]
 * $$
 * 相当于之前是用递归去计算每个状态，现在是枚举并计算每个状态。
 * 
 * 初始值 $f[0]=1,\ f[1]=1$，翻译自递归边界 $dfs(0)=1,\ dfs(1)=1$。
 * 
 * 答案为 $f[n]$，翻译自递归入口 $dfs(n)$。
 */
public class Hot081_LC70_climbStairs3 {
    public int climbStairs(int n) {
        int[] f = new int[n + 1];
        f[0] = f[1] = 1;
        for (int i = 2; i <= n; i++) {
            f[i] = f[i - 1] + f[i - 2];
        }
        return f[n];
    }
}
