package org.lyflexi;

import java.util.*;

/**
 * 41. 缺失的第一个正数
 * 已解答
 * 困难
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给你一个未排序的整数数组 nums ，请你找出其中没有出现的最小的正整数。
 * 
 * 请你实现时间复杂度为 O(n) 并且只使用常数级别额外空间的解决方案。
 * 
 * 示例 1：
 * 
 * 输入：nums = [1,2,0]
 * 输出：3
 * 解释：范围 [1,2] 中的数字都在数组中。
 * 
 * 示例 2：
 * 
 * 输入：nums = [3,4,-1,1]
 * 输出：2
 * 解释：1 在数组中，但 2 没有。
 * 
 * 示例 3：
 * 
 * 输入：nums = [7,8,9,11,12]
 * 输出：1
 * 解释：最小的正数 1 没有出现。
 * 
 * 提示：
 * 
 * - 1 <= nums.length <= 10^5
 * 
 * - -2^31 <= nums[i] <= 2^31 - 1
 */

/**
 * 细节
 * 
 * 判断「学生是否坐在正确的座位上」，能用 $nums[i]=i$ 判断吗？注意有影分身（重复元素）。
 * 
 * 在第三个例子中，虽然 $nums[2]=1\ne 2$，但由于 $nums[nums[2]] = nums[1] = 1$，所以 $nums[2]$ 是个影分身，并且其真身坐在了正确的座位上，所以可以忽略 $nums[2]$，向后遍历。注意这种情况是不能交换的，因为 $nums[2]=nums[1]$，交换后 $nums=[1,1,2]$ 是不变的，这会导致死循环。
 * 
 * 为避免死循环，可以改成判断 $nums[2]$ 和 $nums[nums[2]]$ 是不是一样的。如果一样，就不执行交换，继续向后遍历。
 * 
 * 一般地，为了兼容「当前学生是真身，坐在正确的座位上」和「当前学生是影分身，且其真身坐在正确的座位上」两种情况，我们可以把 $i=nums[i]$ 套一层 $nums$，用 $nums[i]=nums[nums[i]]$ 判断。
 * 
 * - 无论「当前学生是真身，坐在正确的座位上」还是「当前学生是影分身，且其真身坐在正确的座位上」，上式都是成立的。
 * - 如果「当前学生是真身，不坐在正确的座位上」，那么上式左边是当前学生的学号，右边是要交换的学生的学号。
 * - 如果「当前学生是影分身，且其真身不坐在正确的座位上」，那么上式左边是当前学生的学号，右边是要交换的学生的学号。虽然是用影分身交换的，但交换后，可以认为真身已经坐在了正确的座位上。
 * 
 * 代码实现时，由于 $nums$ 的下标是从 $0$ 开始的，通过学号访问下标，要把学号减一。
 * 注：用 Python 的同学请注意，下面代码中的 nums[i], nums[j] = nums[j], nums[i] 不能写成 nums[i], nums[nums[i] - 1] = nums[nums[i] - 1], nums[i]。这会先更新 nums[i] 为 nums[nums[i] - 1]，然后再更新 nums[nums[i] - 1]，但此时 nums[i] - 1 已经不是原来的值了。
 */
public class Hot017_LC41_firstMissingPositive {
    public int firstMissingPositive(int[] nums) {
        int n = nums.length;
        for (int i = 0; i < n; i++) {
            // 如果当前学生的学号在 [1,n] 中，但（真身）没有坐在正确的座位上
            while (1 <= nums[i] && nums[i] <= n && nums[nums[i] - 1] != nums[i]) {
                // 那么就交换 nums[i] 和 nums[j]，其中 j 是 i 的学号
                int j = nums[i] - 1; // 减一是因为数组下标从 0 开始
                int tmp = nums[i];
                nums[i] = nums[j];
                nums[j] = tmp;
            }
        }

        // 找第一个学号与座位编号不匹配的学生
        for (int i = 0; i < n; i++) {
            if (nums[i] != i + 1) {
                return i + 1;
            }
        }

        // 所有学生都坐在正确的座位上
        return n + 1;
    }
}
