package org.lyflexi;

import java.util.*;

/**
 * 62. 不同路径
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。
 * 
 * 机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。
 * 
 * 问总共有多少条不同的路径？
 * 
 * 示例 1：
 * 
 * 输入：m = 3, n = 7
 * 输出：28
 * 
 * 示例 2：
 * 
 * 输入：m = 3, n = 2
 * 输出：3
 * 解释：
 * 从左上角开始，总共有 3 条路径可以到达右下角。
 * 1. 向右 -> 向下 -> 向下
 * 2. 向下 -> 向下 -> 向右
 * 3. 向下 -> 向右 -> 向下
 * 
 * 示例 3：
 * 
 * 输入：m = 7, n = 3
 * 输出：28
 * 
 * 示例 4：
 * 
 * 输入：m = 3, n = 3
 * 输出：6
 * 
 * 提示：
 * 
 * - 1 <= m, n <= 100
 * 
 * - 题目数据保证答案小于等于 2 * 10^9
 */

/**
 * 五、空间优化
 * 
 * 回顾上面的代码，我们在一行一行地计算 $f[i][j]$：算完 $f[i]$，然后算 $f[i+1]$，再算 $f[i+2]$。
 * 
 * 算到 $f[i+2]$ 的时候，$f[i]$ 就再也用不到了。看上去，这里浪费了很多空间。
 * 
 * 能不能只用一个长为 $n+1$ 的数组呢？
 * 
 * 好比在一面墙上画画，原来这面墙画的是 $f[i]$，现在要画一副新的画，把原来的画覆盖掉，新的画叫做 $f[i+1]$。
 * 
 * 在这个「覆盖」的过程中，对于这面墙的其中一个点 $f[i+1][j+1]$，我们要用 $f[i+1][j+1]$ 覆盖掉 $f[i][j+1]$。
 * 
 * 怎么覆盖？看转移方程 $f[i+1][j+1] = f[i][j+1] + f[i+1][j]$。其中 $f[i][j+1]$ 就地取材，$f[i+1][j]$ 是新画的内容，从这面墙的下标 $j$ 处取到。所以空间优化后是 $f[j+1] = f[j+1] + f[j]$，也就是把 $f[j+1]$ 增加 $f[j]$。
 */
public class Hot091_LC62_uniquePaths4 {
    public int uniquePaths(int m, int n) {
        int[] f = new int[n + 1];
        f[1] = 1;
        for (int i = 0; i < m; i++) {
            for (int j = 0; j < n; j++) {
                f[j + 1] += f[j];
            }
        }
        return f[n];
    }
}
