package org.lyflexi;

import java.util.*;

/**
 * 62. 不同路径
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。
 * 
 * 机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。
 * 
 * 问总共有多少条不同的路径？
 * 
 * 示例 1：
 * 
 * 输入：m = 3, n = 7
 * 输出：28
 * 
 * 示例 2：
 * 
 * 输入：m = 3, n = 2
 * 输出：3
 * 解释：
 * 从左上角开始，总共有 3 条路径可以到达右下角。
 * 1. 向右 -> 向下 -> 向下
 * 2. 向下 -> 向下 -> 向右
 * 3. 向下 -> 向右 -> 向下
 * 
 * 示例 3：
 * 
 * 输入：m = 7, n = 3
 * 输出：28
 * 
 * 示例 4：
 * 
 * 输入：m = 3, n = 3
 * 输出：6
 * 
 * 提示：
 * 
 * - 1 <= m, n <= 100
 * 
 * - 题目数据保证答案小于等于 2 * 10^9
 */

/**
 * 也可以把 $f[0][1]$ 初始化成 $1$，这样我们无需单独计算 $f[1][1]$。从 $dfs$ 的角度理解，就是把 $(-1,0)$ 当作起点，且第一步只能往下走。
 */
public class Hot091_LC62_uniquePaths3 {
    public int uniquePaths(int m, int n) {
        int[][] f = new int[m + 1][n + 1];
        f[0][1] = 1;
        for (int i = 0; i < m; i++) {
            for (int j = 0; j < n; j++) {
                f[i + 1][j + 1] = f[i][j + 1] + f[i + 1][j];
            }
        }
        return f[m][n];
    }
}
