package org.lyflexi;

import java.util.*;

/**
 * 200. 岛屿数量
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给你一个由 '1'（陆地）和 '0'（水）组成的的二维网格，请你计算网格中岛屿的数量。
 * 
 * 岛屿总是被水包围，并且每座岛屿只能由水平方向和/或竖直方向上相邻的陆地连接形成。
 * 
 * 此外，你可以假设该网格的四条边均被水包围。
 * 
 * 示例 1：
 * 
 * 输入：grid = [
 *   ['1','1','1','1','0'],
 *   ['1','1','0','1','0'],
 *   ['1','1','0','0','0'],
 *   ['0','0','0','0','0']
 * ]
 * 输出：1
 * 
 * 示例 2：
 * 
 * 输入：grid = [
 *   ['1','1','0','0','0'],
 *   ['1','1','0','0','0'],
 *   ['0','0','1','0','0'],
 *   ['0','0','0','1','1']
 * ]
 * 输出：3
 * 
 * 提示：
 * 
 * - m == grid.length
 * 
 * - n == grid[i].length
 * 
 * - 1 <= m, n <= 300
 * 
 * - grid[i][j] 的值为 '0' 或 '1'
 */

/**
 * 答疑
 * 
 * 问：二叉树的递归和网格图的递归有何区别？
 * 
 * 答：列表总结如下。
 * 
 * |   | 二叉树  |  网格图 |
 * |---|---|---|
 * | 递归入口  |  根节点  |  岛屿第一行最左边的陆地  |
 * | 递归方向  |  左儿子和右儿子 |  左右上下的相邻陆地  |
 * | 递归边界 |  空节点（或者叶节点） | 出界、遇到水或者旗子  |
 * 
 * 问：如何理解递归？
 * 
 * 答：递归的思想是，假设你是一家公司的老板，你不需要万事亲力亲为，而是拆解问题，交给下属去做。对于这题来说，就是从岛屿的某个位置登陆插旗，然后一分为四，把探索整个岛屿的任务交给其他人去处理，自己只需处理好第一步就行。
 * 
 * 问：我可以先判断 $grid[i][j]$ 是否等于 $1$，再判断 $(i,j)$ 是否出界吗？
 * 
 * 问：不行，比如 $i=-1$，获取 $grid[i][j]$ 就下标越界了。要先保证下标在范围中，再去获取数组元素值。
 * 
 * 问：我可以把访问过的 $grid[i][j]$ 改成 $0$ 吗？
 * 
 * 答：可以。相当于把访问过的位置变成水。其实，改成除了 $1$ 以外的任何值都行。
 * 
 * 问：我可以把这行代码 grid[i][j] = '2' 写在 $dfs$ 的最后一行吗？
 * 
 * 答：不行。这样写会先执行递归，比如从左上角 $(0,0)$ 向右移动到 $(0,1)$，内部继续递归，从 $(0,1)$ 又向左移动到 $(0,0)$，导致反复横跳，无限递归。
 * 
 * 问：DFS 中能否只考虑往右走和往下走？
 * 
 * 答：不行，比如蚊香形的岛屿，在探索的时候必须具备左右上下走的能力。
 */
public class Hot051_LC200_numIslands {
    public int numIslands(char[][] grid) {
        int ans = 0;
        for (int i = 0; i < grid.length; i++) {
            for (int j = 0; j < grid[i].length; j++) {
                if (grid[i][j] == '1') { // 找到了一个新的岛
                    dfs(grid, i, j); // 把这个岛插满旗子，这样后面遍历到的 '1' 一定是新的岛
                    ans++;
                }
            }
        }
        return ans;
    }

    private void dfs(char[][] grid, int i, int j) {
        // 出界，或者不是 '1'，就不再往下递归
        if (i < 0 || i >= grid.length || j < 0 || j >= grid[0].length || grid[i][j] != '1') {
            return;
        }
        grid[i][j] = '2'; // 插旗！避免来回横跳无限递归
        dfs(grid, i, j - 1); // 往左走
        dfs(grid, i, j + 1); // 往右走
        dfs(grid, i - 1, j); // 往上走
        dfs(grid, i + 1, j); // 往下走
    }
}
