package org.lyflexi;

import java.util.*;

/**
 * 70. 爬楼梯
 * 已解答
 * 简单
 * 相关标签
 * premium lock icon
 * 相关企业
 * 假设你正在爬楼梯。需要 n 阶你才能到达楼顶。
 * 
 * 每次你可以爬 1 或 2 个台阶。你有多少种不同的方法可以爬到楼顶呢？
 * 
 * 示例 1：
 * 
 * 输入：n = 2
 * 输出：2
 * 解释：有两种方法可以爬到楼顶。
 * 1. 1 阶 + 1 阶
 * 2. 2 阶
 * 
 * 示例 2：
 * 
 * 输入：n = 3
 * 输出：3
 * 解释：有三种方法可以爬到楼顶。
 * 1. 1 阶 + 1 阶 + 1 阶
 * 2. 1 阶 + 2 阶
 * 3. 2 阶 + 1 阶
 * 
 * 提示：
 * 
 * - 1 <= n <= 45
 */

/**
 * 五、空间优化
 * 
 * 观察状态转移方程，发现一旦算出 $f[i]$，那么 $f[i-2]$ 及其左边的状态就永远不会用到了。
 * 
 * 这意味着每次循环，只需要知道「上一个状态」和「上上一个状态」的 $f$ 值是多少，分别记作 $f_1$ 和 $f_0$。它俩的初始值均为 $1$，对应着 $f[1]$ 和 $f[0]$。
 * 
 * 每次循环，计算出新的状态 $newF = f_1 + f_0$，那么对于下一轮循环来说：
 * 
 * - 「上上一个状态」就是 $f_1$，更新 $f_0 = f_1$。
 * - 「上一个状态」就是 $newF$，更新 $f_1 = newF$。
 * 
 * 最后答案为 $f_1$，因为最后一轮循环算出的 $newF$ 赋给了 $f_1$。
 */
public class Hot081_LC70_climbStairs4 {
    public int climbStairs(int n) {
        int f0 = 1;
        int f1 = 1;
        for (int i = 2; i <= n; i++) {
            int newF = f1 + f0;
            f0 = f1;
            f1 = newF;
        }
        return f1;
    }
}
