package org.lyflexi;

import java.util.*;

/**
 * 75. 颜色分类
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给定一个包含红色、白色和蓝色、共 n 个元素的数组 nums ，原地 对它们进行排序，使得相同颜色的元素相邻，并按照红色、白色、蓝色顺序排列。
 * 
 * 我们使用整数 0、 1 和 2 分别表示红色、白色和蓝色。
 * 
 * 必须在不使用库内置的 sort 函数的情况下解决这个问题。
 * 
 * 示例 1：
 * 
 * 输入：nums = [2,0,2,1,1,0]
 * 
 * 输出：[0,0,1,1,2,2]
 * 
 * 解释：
 * 
 * 该数组包含两个 0、两个 1 和两个 2。将它们原地排序后，所有 0 排在最前面，接着是所有 1，最后是所有 2。
 * 
 * 示例 2：
 * 
 * 输入：nums = [2,0,1]
 * 
 * 输出：[0,1,2]
 * 
 * 解释：
 * 
 * 数组中有且仅有一个 0、一个 1 和一个 2，按 0、1、2 的顺序原地排列。
 * 
 * 提示：
 * 
 * - n == nums.length
 * 
 * - 1 <= n <= 300
 * 
 * - nums[i] 为 0、1 或 2
 * 
 * 进阶：
 * 
 * - 你能想出一个仅使用常数空间的一趟扫描算法吗？
 */

/**
 * 本题思路
 * 
 * 对 $nums$ 执行插入排序，也就是对 $i=0,1,2,\ldots,n-1$ 依次执行如下过程：
 * 
 * - 现在前缀 $nums[0]$ 到 $nums[i-1]$ 是有序的，把 $nums[i]$ 插入这个有序前缀，从而把前缀 $nums[0]$ 到 $nums[i]$ 变成有序的。
 * - 算法执行完后，$nums$ 就是一个有序数组了。
 */
public class Hot098_LC75_sortColors {
    public void sortColors(int[] nums) {
        int p0 = 0;
        int p1 = 0;
        for (int i = 0; i < nums.length; i++) {
            int x = nums[i];
            nums[i] = 2;
            if (x <= 1) {
                nums[p1++] = 1;
            }
            if (x == 0) {
                nums[p0++] = 0;
            }
        }
    }
}
