package org.lyflexi;

import java.util.*;

/**
 * 70. 爬楼梯
 * 已解答
 * 简单
 * 相关标签
 * premium lock icon
 * 相关企业
 * 假设你正在爬楼梯。需要 n 阶你才能到达楼顶。
 * 
 * 每次你可以爬 1 或 2 个台阶。你有多少种不同的方法可以爬到楼顶呢？
 * 
 * 示例 1：
 * 
 * 输入：n = 2
 * 输出：2
 * 解释：有两种方法可以爬到楼顶。
 * 1. 1 阶 + 1 阶
 * 2. 2 阶
 * 
 * 示例 2：
 * 
 * 输入：n = 3
 * 输出：3
 * 解释：有三种方法可以爬到楼顶。
 * 1. 1 阶 + 1 阶 + 1 阶
 * 2. 1 阶 + 2 阶
 * 3. 2 阶 + 1 阶
 * 
 * 提示：
 * 
 * - 1 <= n <= 45
 */

/**
 * 三、递归 + 记录返回值 = 记忆化搜索
 * 
 * 上面的做法太慢了，怎么优化呢？
 * 
 * 注意到「先爬 $1$ 个台阶，再爬 $2$ 个台阶」和「先爬 $2$ 个台阶，再爬 $1$ 个台阶」，都相当于爬 $3$ 个台阶，都会从 $dfs(i)$ 递归到 $dfs(i-3)$。
 * 
 * 一叶知秋，整个递归中有大量重复递归调用（递归入参相同）。由于递归函数没有副作用，同样的入参无论计算多少次，算出来的结果都是一样的，因此可以用记忆化搜索来优化：
 * 
 * - 如果一个状态（递归入参）是第一次遇到，那么可以在返回前，把状态及其结果记到一个 $memo$ 数组中。
 * - 如果一个状态不是第一次遇到（$memo$ 中保存的结果不等于 $memo$ 的初始值），那么可以直接返回 $memo$ 中保存的结果。
 * 
 * 注意：$memo$ 数组的初始值一定不能等于要记忆化的值！例如初始值设置为 $0$，并且要记忆化的 $dfs(i)$ 也等于 $0$，那就没法判断 $0$ 到底表示第一次遇到这个状态，还是表示之前遇到过了，从而导致记忆化失效。一般把初始值设置为 $-1$。本题由于方案数均为正数，所以可以初始化成 $0$。
 * Python 用户可以无视上面这段，直接用 @cache 装饰器。
 */
public class Hot081_LC70_climbStairs2 {
    public int climbStairs(int n) {
        int[] memo = new int[n + 1];
        return dfs(n, memo);
    }

    private int dfs(int i, int[] memo) {
        if (i <= 1) { // 递归边界
            return 1;
        }
        if (memo[i] != 0) { // 之前计算过
            return memo[i];
        }
        return memo[i] = dfs(i - 1, memo) + dfs(i - 2, memo); // 记忆化
    }
}
