package org.lyflexi;

import java.util.*;

/**
 * 62. 不同路径
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 一个机器人位于一个 m x n 网格的左上角 （起始点在下图中标记为 “Start” ）。
 * 
 * 机器人每次只能向下或者向右移动一步。机器人试图达到网格的右下角（在下图中标记为 “Finish” ）。
 * 
 * 问总共有多少条不同的路径？
 * 
 * 示例 1：
 * 
 * 输入：m = 3, n = 7
 * 输出：28
 * 
 * 示例 2：
 * 
 * 输入：m = 3, n = 2
 * 输出：3
 * 解释：
 * 从左上角开始，总共有 3 条路径可以到达右下角。
 * 1. 向右 -> 向下 -> 向下
 * 2. 向下 -> 向下 -> 向右
 * 3. 向下 -> 向右 -> 向下
 * 
 * 示例 3：
 * 
 * 输入：m = 7, n = 3
 * 输出：28
 * 
 * 示例 4：
 * 
 * 输入：m = 3, n = 3
 * 输出：6
 * 
 * 提示：
 * 
 * - 1 <= m, n <= 100
 * 
 * - 题目数据保证答案小于等于 2 * 10^9
 */

/**
 * 组合数的计算方法
 * 
 * 本题保证答案小于等于 $2× 10^9$，可以用简单的循环计算组合数。
 * 
 * 组合数的计算公式为
 * 
 * $$
 * \binom n i = \dfrac{n!}{i!(n-i)!}
 * $$
 * 
 * 把 $i$ 替换成 $i-1$，可得
 * 
 * $$
 * \binom n {i-1} = \dfrac{n!}{(i-1)!(n-i+1)!}
 * $$
 * 
 * 对比上面两个等式，可以得到如下递推式
 * 
 * $$
 * \binom n i = \dfrac{\binom n {i-1} (n-i+1)}{i}
 * $$
 * 
 * 由于等式左边 $\dbinom n i$ 是整数，所以等式右边的除法一定能整除。
 * 
 * 例如
 * 
 * $$
 * \binom 9 4 = \dfrac{9× 8× 7× 6}{1× 2× 3× 4}
 * $$
 * 
 * 可以先计算 $\dfrac{9}{1} = 9$，然后计算 $\dfrac{9× 8}{2} = 36$，然后计算 $\dfrac{36× 7}{3} = 84$，最后计算 $\dfrac{84× 6}{4} = 126$。
 * 注：也可以这样理解，由于任意连续 $i$ 个数中必然有 $i$ 的倍数，所以上述计算过程均为整除，不会产生小数。
 * 
 * 所以可以写一个简单的循环，计算
 * 
 * $$
 * \binom n k = \dfrac{n× (n-1)× ... × (n+1-k)}{1× 2× ...× k}
 * $$
 * 
 * 如果 $k$ 比较大，可以用组合数恒等式
 * 
 * $$
 * \binom n k = \binom n {n-k}
 * $$
 * 
 * 减少循环次数。
 */
public class Hot091_LC62_uniquePaths5 {
    public int uniquePaths(int m, int n) {
        return (int) comb(m + n - 2, m - 1);
    }

    private long comb(int n, int k) {
        k = Math.min(k, n - k);
        long res = 1;
        for (int i = 1; i <= k; i++) {
            res = res * (n + 1 - i) / i;
        }
        return res;
    }
}
