package org.lyflexi;

import java.util.*;

/**
 * 287. 寻找重复数
 * 已解答
 * 中等
 * 相关标签
 * premium lock icon
 * 相关企业
 * 给定一个包含 n + 1 个整数的数组 nums ，其数字都在 [1, n] 范围内（包括 1 和 n），可知至少存在一个重复的整数。
 * 
 * 假设 nums 只有 一个重复的整数 ，返回 这个重复的数 。
 * 
 * 你设计的解决方案必须 不修改 数组 nums 且只用常量级 O(1) 的额外空间。
 * 
 * 示例 1：
 * 
 * 输入：nums = [1,3,4,2,2]
 * 输出：2
 * 
 * 示例 2：
 * 
 * 输入：nums = [3,1,3,4,2]
 * 输出：3
 * 
 * 示例 3 :
 * 
 * 输入：nums = [3,3,3,3,3]
 * 输出：3
 * 
 * 提示：
 * 
 * - 1 <= n <= 10^5
 * 
 * - nums.length == n + 1
 * 
 * - 1 <= nums[i] <= n
 * 
 * - nums 中 只有一个整数 出现 两次或多次 ，其余整数均只出现 一次
 * 
 * 进阶：
 * 
 * - 如何证明 nums 中至少存在一个重复的数字?
 * 
 * - 你可以设计一个线性级时间复杂度 O(n) 的解决方案吗？
 */

/**
 * 想象有一个 $n+1$ 个节点的图，节点编号从 $0$ 到 $n$。
 * 
 * 对 $i=0,1,2,...,n$，连一条从 $i$ 到 $nums[i]$ 的有向边，可以得到一个有向图。
 * 
 * 每个节点的入度，就是这个节点在 $nums$ 中的出现次数。重复元素的入度大于 $1$。上图中的节点 $2$ 的入度为 $2$，所以 $2$ 是重复元素。
 * 
 * 如何找到入度大于 $1$ 的节点？
 * 
 * 在每个节点的出度都是 $1$ 的情况下，$n+1$ 个点 $n+1$ 条边的有向图，又叫内向基环森林，每个连通块都恰好有一个环。
 * 
 * 由于 $nums[i]>= 1$，所以节点 $0$ 的入度是 $0$，不在环上。从节点 $0$ 出发，进入基环，基环的入环口，就是入度大于 $1$ 的节点。
 * 
 * ⚠注意：如果从非 $0$ 节点出发，可能无法找到答案。如下图，如果从节点 $3$ 出发，无法找到入度大于 $1$ 的节点。
 * 
 * 考察包含节点 $0$ 的连通块，其形状和 142. 环形链表 II 是一样的，所以都可以用快慢指针解决，详见 我的题解，包含图解和视频讲解。
 * 
 * 这两题的联系如下表，注意 $i$ 和 $nums[i]$ 都是节点。
 * 
 * |  142. 环形链表 II |  287. 寻找重复数  |
 * |---|---|
 * | 链表节点 $node$  |  $i$ |
 * | 下一个节点 $node.next$  | $nums[i]$  |
 * | 头节点 $head$   |  $0$ |
 * | 入环口  |  重复元素 |
 * 
 * 在链表中，我们的移动方式是从节点 $node$ 移动到下一个节点 $node.next$。
 * 
 * 在数组中，我们的移动方式是从节点 $i$ 移动到节点 $nums[i]$。由于数组长度是 $n+1$，而 $nums[i] < n+1$，所以不会下标越界。
 */
// 代码逻辑同 142. 环形链表 II
public class Hot100_LC287_findDuplicate {
    public int findDuplicate(int[] nums) {
        int slow = 0; // 0 一定不在环上，适合作为起点
        int fast = 0;
        while (true) {
            slow = nums[slow]; // 等价于 slow = slow.next
            fast = nums[nums[fast]]; // 等价于 fast = fast.next.next
            if (fast == slow) { // 快慢指针移动到同一个节点
                break;
            }
        }

        int head = 0; // 再用一个指针，从起点出发
        while (slow != head) {
            slow = nums[slow];
            head = nums[head];
        }
        return slow; // 入环口即重复元素
    }
}
